MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_gptimer.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_gptimer__include
#define ti_devices_msp_peripherals_hw_gptimer__include

/* Filename: hw_gptimer.h */
/* Revised: 2024-06-04 10:48:04 */
/* Revision: a6be75578aae0bf7330b042a9fb5c36fc4988a43 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* GPTIMER Registers
******************************************************************************/
#define GPTIMER_COUNTERREGS_OFS                  ((uint32_t)0x00001800U)
#define GPTIMER_COMMONREGS_OFS                   ((uint32_t)0x00001100U)
#define GPTIMER_GEN_EVENT1_OFS                   ((uint32_t)0x00001080U)
#define GPTIMER_GEN_EVENT0_OFS                   ((uint32_t)0x00001050U)
#define GPTIMER_CPU_INT_OFS                      ((uint32_t)0x00001020U)
#define GPTIMER_GPRCM_OFS                        ((uint32_t)0x00000800U)


/** @addtogroup GPTIMER_COUNTERREGS
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x00001800) Counter Register */
  __IO uint32_t CTRCTL;                            /* !< (@ 0x00001804) Counter Control Register */
  __IO uint32_t LOAD;                              /* !< (@ 0x00001808) Load Register */
       uint32_t RESERVED0;
  __IO uint32_t CC_01[2];                          /* !< (@ 0x00001810) Capture or Compare Register 0/1 */
  __IO uint32_t CC_23[2];                          /* !< (@ 0x00001818) Capture or Compare Register 2/3 */
  __IO uint32_t CC_45[2];                          /* !< (@ 0x00001820) The CC_45 register are a registers which can be
                                                      used as compare to the current CTR to create an events CC4U, CC4D,
                                                      CC5U and CC5D. */
       uint32_t RESERVED1[2];
  __IO uint32_t CCCTL_01[2];                       /* !< (@ 0x00001830) Capture or Compare Control Registers 0/1 */
  __IO uint32_t CCCTL_23[2];                       /* !< (@ 0x00001838) Capture or Compare Control Registers 2/3 */
  __IO uint32_t CCCTL_45[2];                       /* !< (@ 0x00001840) Capture or Compare Control Registers 4/5 */
       uint32_t RESERVED2[2];
  __IO uint32_t OCTL_01[2];                        /* !< (@ 0x00001850) CCP Output Control Registers 0/1 */
  __IO uint32_t OCTL_23[2];                        /* !< (@ 0x00001858) CCP Output Control Registers 2/3 */
       uint32_t RESERVED3[4];
  __IO uint32_t CCACT_01[2];                       /* !< (@ 0x00001870) Capture or Compare Action Registers 0/1 */
  __IO uint32_t CCACT_23[2];                       /* !< (@ 0x00001878) Capture or Compare Action Registers 2/3 */
  __IO uint32_t IFCTL_01[2];                       /* !< (@ 0x00001880) Input Filter Control Register 0/1 */
  __IO uint32_t IFCTL_23[2];                       /* !< (@ 0x00001888) Input Filter Control Register 2/3 */
       uint32_t RESERVED4[4];
  __IO uint32_t PL;                                /* !< (@ 0x000018A0) Phase Load Register */
  __IO uint32_t DBCTL;                             /* !< (@ 0x000018A4) Dead Band insertion control register */
       uint32_t RESERVED5[2];
  __IO uint32_t TSEL;                              /* !< (@ 0x000018B0) Trigger Select Register */
  __I  uint32_t RC;                                /* !< (@ 0x000018B4) Repeat counter Register */
  __IO uint32_t RCLD;                              /* !< (@ 0x000018B8) Repeat counter load Register */
  __I  uint32_t QDIR;                              /* !< (@ 0x000018BC) QEI Count Direction Register */
       uint32_t RESERVED6[4];
  __IO uint32_t FCTL;                              /* !< (@ 0x000018D0) Fault Control Register */
  __IO uint32_t FIFCTL;                            /* !< (@ 0x000018D4) Fault input Filter control register */
} GPTIMER_COUNTERREGS_Regs;

